import pandas as pd

data = {
    'Товар': ['Смартфон', 'Ноутбук', 'Наушники', 'Монитор', 'Клавиатура', 'Мышь'],
    'Категория': ['Гаджеты', 'Компьютеры', 'Гаджеты', 'Компьютеры', 'Аксессуары', 'Аксессуары'],
    'Цена': [50000, 90000, 15000, 25000, 5000, 3000],
    'Количество': [10, 5, 20, 0, 15, 30] # Сколько штук на складе
}

df = pd.DataFrame(data)



print(df[ df['Категория'] == 'Аксессуары' ])

df["Общая_стоимость"] = df["Цена"] * df["Количество"]
print(df["Общая_стоимость"].sum())
print(df.isnull().sum())

df["Цена_со_скидкой"] = df["Цена"] * 0.8
print(df.head())
